Type of the curve element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public CurveElementType CurveElementType { get; }
  Visual Basic
Public ReadOnly Property CurveElementType As CurveElementType
	Get
  Visual C++
public:
property CurveElementType CurveElementType {
	CurveElementType get ();
}
 See Also
  CurveElement Class
  Autodesk.Revit.DB Namespace